# IsPlanarObj

## Description
```pascal
FUNCTION IsPlanarObj(
				object       : HANDLE;
				VAR NewParam : LONGINT) : BOOLEAN;
```

```python

def vs.IsPlanarObj(object):
    return (BOOLEAN, NewParam)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|Object to test|
|NewParam|LONGINT|If object is planar, returns the planar refID of its plane|

## Version
Availability: from Vectorworks 2016
## Category
* Object Attributes